package dev.stupak.main.common

fun getRegionUid(regionName: String): Int {
    val regions = mapOf(
        "Хмельницька область" to 3,
        "Вінницька область" to 4,
        "Рівненська область" to 5,
        "Волинська область" to 8,
        "Дніпропетровська область" to 9,
        "Житомирська область" to 10,
        "Закарпатська область" to 11,
        "Запорізька область" to 12,
        "Івано-Франківська область" to 13,
        "Київська область" to 14,
        "Кіровоградська область" to 15,
        "Луганська область" to 16,
        "Миколаївська область" to 17,
        "Одеська область" to 18,
        "Полтавська область" to 19,
        "Сумська область" to 20,
        "Тернопільська область" to 21,
        "Харківська область" to 22,
        "Херсонська область" to 23,
        "Черкаська область" to 24,
        "Чернігівська область" to 25,
        "Чернівецька область" to 26,
        "Львівська область" to 27,
        "Донецька область" to 28,
        "Автономна Республіка Крим" to 29,
        "м. Севастополь" to 30,
        "м. Київ" to 31
    )

    return regions[regionName] ?: throw IllegalArgumentException()
}
